[
  {
    "message": "I had the pleasure of working with and managing Michelle (not that she needed it) from February to October, 2024. During our time together Michelle consistently demonstrated strong attention to detail and a rock-solid work ethic. She always approached tasks with enthusiasm, flexibility, and a collaborative mindset; she is the kind of person you can rely on to get the job done efficiently, without sacrificing quality. I would honestly jump at the opportunity to work with Michelle again, she is a great asset to any team lucky enough to have her.",
    "attribution": "Enterprise Manager @ Delta Controls"
  },
  {
    "message": "Michelle is a very strong designer with a comprehensive understanding of both design and web development. We hired her as a Design Intern during her co-op term, and I was consistently impressed by her dedication and skill. After her graduation, we eagerly offered her a full-time role. I was particularly impressed by Michelle’s ability to take product requirement specifications and quickly come up with various creative product design. She was also a great team player taking on many marketing design responsibilities and led the development of our website in Webflow. Furthermore, her commitment to designing and developing with proper components helped us create very scalable solutions. Michelle would be a tremendous asset to any team looking for outstanding design!",
    "attribution": "Co-CEO @ Guusto"
  },
  {
    "message": "When Michelle started as a co-op student at Guusto, she proved to be an exceptional designer who was eager to tackle any task. Her sharp eye and quick implementation of feedback led to better branding on our marketing site and a superior user experience in the Guusto app. Michelle also possesses technical skills and was able to assist with front-end development during busy periods. This experience enabled her to work effectively with the engineering team, as she understands the boundaries and intricacies of the technology used in our tech stack.",
    "attribution": "Head of HR @ Guusto"
  },
  {
    "message": "Michelle is skilled at extracting the essence of any project to tell a strategic and emotive visual narrative. She contributes great ideas and advocates for each initiative's success, adapting frequently and learning fast as she grows in her career. On top of her technical design skills, Michelle is a wonderful collaborator with a warm personality. She would be an amazing addition to any design, marketing, or product team.",
    "attribution": "Product Marketing Manager @ Guusto"
  },
  {
    "message": "Good enough doesn’t cut it for Michelle. In the last 3 years as her manager, she has been exceptional in consistently challenging the status quo and proposing new approaches whether it be in her work or internal processes. But what particularly amazed me was that she would proactively get eyes on her proposals and rarely act in a silo. She has an awe-inspiring ability in making others feel included and befriended. Despite being a junior designer at Guusto, Michelle has created a culture of change and support and would be an asset to any design team.",
    "attribution": "Senior Product Designer @ Guusto"
  },
  {
    "message": "Michelle is a focused, detail-oriented designer who can take a big picture idea and distill it into a beautiful creative piece. I had the pleasure of leading Michelle during her 3 month apprenticeship with the Forum for Women Entrepreneurs, a national charitable organization the educates and mentors women entrepreneurs. Michelle supported FWE's marketing and communication endeavours during one of the busiest times of the year and supported our organization with graphic design work, video compilation, content writing and creation, and data entry. Michelle handled every project I threw at her with ease and efficiency!",
    "attribution": "Marketing & Communications Manager @ FWE"
  },
  {
    "message": "I am very grateful that we had Michelle on our team. She has a true 'getting things done' mentality and is very versatile across the Adobe Suite. Given the breadth of design challenges we as a startup faced it was amazing to have someone that is willing and capable to meet the various design needs.",
    "attribution": "Founder @ Vly"
  }
]
